## Mean, Median, Mode

In [2]:
import pandas as pd
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
'Lee','Chanchal','Gasper','Naviya','Andres']),
'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)

In [13]:
df

        Name  Age  Rating
0        Tom   25    4.23
1      James   26    3.24
2      Ricky   25    3.98
3        Vin   23    2.56
4      Steve   30    3.20
5      Smith   29    4.60
6       Jack   23    3.80
7        Lee   34    3.78
8   Chanchal   40    2.98
9     Gasper   30    4.80
10    Naviya   51    4.10
11    Andres   46    3.65

In [5]:
print ("Mean Values in the Distribution")
print (df.mean())
print ("*******************************")
print ("Median Values in the Distribution")
print (df.median())

Mean Values in the Distribution
Age       31.833333
Rating     3.743333
dtype: float64
*******************************
Median Values in the Distribution
Age       29.50
Rating     3.79
dtype: float64

<ipython-input-5-0d165f53f4c4>:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print (df.mean())
<ipython-input-5-0d165f53f4c4>:5: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print (df.median())

In [14]:
import pandas as pd
#Create a Dictionary of series
d ={'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
'Lee','Chanchal','Gasper','Naviya','Andres']),
'Age':pd.Series([25,26,25,23,30,25,23,34,40,30,25,46])}
#Create a DataFrame
df = pd.DataFrame(d)
df

        Name  Age
0        Tom   25
1      James   26
2      Ricky   25
3        Vin   23
4      Steve   30
5      Smith   25
6       Jack   23
7        Lee   34
8   Chanchal   40
9     Gasper   30
10    Naviya   25
11    Andres   46

In [15]:
print (df.mode())

        Name   Age
0     Andres  25.0
1   Chanchal   NaN
2     Gasper   NaN
3       Jack   NaN
4      James   NaN
5        Lee   NaN
6     Naviya   NaN
7      Ricky   NaN
8      Smith   NaN
9      Steve   NaN
10       Tom   NaN
11       Vin   NaN

## Q1, Q2, Q3

In [9]:
import numpy as np
# 1D array
arr = [20, 2, 7, 1, 34]
print("arr : ", arr)
print("Q2 quantile of arr : ", np.quantile(arr, .50))
print("Q1 quantile of arr : ", np.quantile(arr, .25))
print("Q3 quantile of arr : ", np.quantile(arr, .75))
print("100th quantile of arr : ", np.quantile(arr, .1))

arr :  [20, 2, 7, 1, 34]
Q2 quantile of arr :  7.0
Q1 quantile of arr :  2.0
Q3 quantile of arr :  20.0
100th quantile of arr :  1.4

## Percentile

In [10]:
import numpy as np
# 1D array
arr = [20, 2, 7, 1, 34]
print("arr : ", arr)
print("50th percentile of arr : ", np.percentile(arr, 50))
print("25th percentile of arr : ", np.percentile(arr, 25))
print("75th percentile of arr : ", np.percentile(arr, 75))

arr :  [20, 2, 7, 1, 34]
50th percentile of arr :  7.0
25th percentile of arr :  2.0
75th percentile of arr :  20.0

In [16]:
import pandas as pd
one = pd.DataFrame({
'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
'subject_id':['sub1','sub2','sub4','sub6','sub5'],
'Marks_scored':[98,90,87,69,78]},
index=[1,2,3,4,5])
two = pd.DataFrame({
'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
'subject_id':['sub2','sub4','sub3','sub6','sub5'],
'Marks_scored':[89,80,79,97,88]},
index=[1,2,3,4,5])
print (pd.concat([one,two]))

     Name subject_id  Marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88